; domain
(define (domain gripper-strips)
 (:requirements :strips :typing) 
 (:types room object robot gripper)
 (:predicates (at-robby ?r - robot ?x - room)
 	      (at ?o - object ?x - room)
	      (free ?r - robot ?g - gripper)
	      (carry ?r - robot ?o - object ?g - gripper))

   (:action move
       :parameters  (?r - robot ?from ?to - room)
       :precondition (and  (at-robby ?r ?from))
       :effect (and  (at-robby ?r ?to)
		     (not (at-robby ?r ?from))))

   (:action pick
       :parameters (?r - robot ?obj - object ?room - room ?g - gripper)
       :precondition  (and  (at ?obj ?room) (at-robby ?r ?room) (free ?r ?g))
       :effect (and (carry ?r ?obj ?g)
		    (not (at ?obj ?room)) 
		    (not (free ?r ?g))))

   (:action drop
       :parameters (?r - robot ?obj - object ?room - room ?g - gripper)
       :precondition  (and  (carry ?r ?obj ?g) (at-robby ?r ?room))
       :effect (and (at ?obj ?room)
		    (free ?r ?g)
		    (not (carry ?r ?obj ?g)))))

; problem
(define (problem gripper-2-5-15)
(:domain gripper-strips)
(:objects robot1 robot2 - robot
rgripper1 lgripper1 rgripper2 lgripper2 - gripper
room1 room2 room3 room4 room5 - room
ball1 ball2 ball3 ball4 ball5 ball6 ball7 ball8 ball9 ball10 ball11 ball12 ball13 ball14 ball15 - object)
(:init
(at-robby robot1 room2)
(free robot1 rgripper1)
(free robot1 lgripper1)
(at-robby robot2 room5)
(free robot2 rgripper2)
(free robot2 lgripper2)
(at ball1 room5)
(at ball2 room4)
(at ball3 room4)
(at ball4 room5)
(at ball5 room4)
(at ball6 room1)
(at ball7 room3)
(at ball8 room1)
(at ball9 room2)
(at ball10 room5)
(at ball11 room4)
(at ball12 room3)
(at ball13 room2)
(at ball14 room5)
(at ball15 room3)
)
(:goal
(and
(at ball1 room2)
(at ball2 room4)
(at ball3 room2)
(at ball4 room2)
(at ball5 room4)
(at ball6 room5)
(at ball7 room3)
(at ball8 room3)
(at ball9 room3)
(at ball10 room2)
(at ball11 room1)
(at ball12 room1)
(at ball13 room3)
(at ball14 room5)
(at ball15 room2)
)
)
)

; plan
1. (pick robot1 ball9 room2 rgripper1)
   deleted: (at ball9 room2) (free robot1 rgripper1)
   added: (carry robot1 ball9 rgripper1)
   goals met: 4 of 15
2. (pick robot2 ball10 room5 lgripper2)
   deleted: (at ball10 room5) (free robot2 lgripper2)
   added: (carry robot2 ball10 lgripper2)
   goals met: 4 of 15
3. (pick robot2 ball4 room5 rgripper2)
   deleted: (at ball4 room5) (free robot2 rgripper2)
   added: (carry robot2 ball4 rgripper2)
   goals met: 4 of 15
4. (pick robot1 ball13 room2 lgripper1)
   deleted: (at ball13 room2) (free robot1 lgripper1)
   added: (carry robot1 ball13 lgripper1)
   goals met: 4 of 15
5. (move robot1 room2 room1)
   deleted: (at-robby robot1 room2)
   added: (at-robby robot1 room1)
   goals met: 4 of 15
6. (move robot2 room5 room3)
   deleted: (at-robby robot2 room5)
   added: (at-robby robot2 room3)
   goals met: 4 of 15
7. (move robot1 room1 room3)
   deleted: (at-robby robot1 room1)
   added: (at-robby robot1 room3)
   goals met: 4 of 15
8. (drop robot1 ball9 room3 rgripper1)
   deleted: (carry robot1 ball9 rgripper1)
   added: (at ball9 room3) (free robot1 rgripper1)
   goals met: 5 of 15
9. (drop robot1 ball13 room3 lgripper1)
   deleted: (carry robot1 ball13 lgripper1)
   added: (at ball13 room3) (free robot1 lgripper1)
   goals met: 6 of 15
10. (pick robot1 ball15 room3 rgripper1)
   deleted: (at ball15 room3) (free robot1 rgripper1)
   added: (carry robot1 ball15 rgripper1)
   goals met: 6 of 15
11. (pick robot1 ball12 room3 lgripper1)
   deleted: (at ball12 room3) (free robot1 lgripper1)
   added: (carry robot1 ball12 lgripper1)
   goals met: 6 of 15
12. (move robot1 room3 room4)
   deleted: (at-robby robot1 room3)
   added: (at-robby robot1 room4)
   goals met: 6 of 15
13. (move robot1 room4 room1)
   deleted: (at-robby robot1 room4)
   added: (at-robby robot1 room1)
   goals met: 6 of 15
14. (drop robot1 ball12 room1 lgripper1)
   deleted: (carry robot1 ball12 lgripper1)
   added: (at ball12 room1) (free robot1 lgripper1)
   goals met: 7 of 15
15. (pick robot1 ball8 room1 lgripper1)
   deleted: (at ball8 room1) (free robot1 lgripper1)
   added: (carry robot1 ball8 lgripper1)
   goals met: 7 of 15
16. (move robot1 room1 room3)
   deleted: (at-robby robot1 room1)
   added: (at-robby robot1 room3)
   goals met: 7 of 15
17. (drop robot1 ball8 room3 lgripper1)
   deleted: (carry robot1 ball8 lgripper1)
   added: (at ball8 room3) (free robot1 lgripper1)
   goals met: 8 of 15
18. (move robot1 room3 room2)
   deleted: (at-robby robot1 room3)
   added: (at-robby robot1 room2)
   goals met: 8 of 15
19. (drop robot1 ball15 room2 rgripper1)
   deleted: (carry robot1 ball15 rgripper1)
   added: (at ball15 room2) (free robot1 rgripper1)
   goals met: 9 of 15
20. (move robot2 room3 room2)
   deleted: (at-robby robot2 room3)
   added: (at-robby robot2 room2)
   goals met: 9 of 15
21. (drop robot2 ball10 room2 lgripper2)
   deleted: (carry robot2 ball10 lgripper2)
   added: (at ball10 room2) (free robot2 lgripper2)
   goals met: 10 of 15
22. (drop robot2 ball4 room2 rgripper2)
   deleted: (carry robot2 ball4 rgripper2)
   added: (at ball4 room2) (free robot2 rgripper2)
   goals met: 11 of 15
23. (move robot1 room2 room4)
   deleted: (at-robby robot1 room2)
   added: (at-robby robot1 room4)
   goals met: 11 of 15
24. (pick robot1 ball3 room4 rgripper1)
   deleted: (at ball3 room4) (free robot1 rgripper1)
   added: (carry robot1 ball3 rgripper1)
   goals met: 11 of 15
25. (pick robot1 ball11 room4 lgripper1)
   deleted: (at ball11 room4) (free robot1 lgripper1)
   added: (carry robot1 ball11 lgripper1)
   goals met: 11 of 15
26. (move robot1 room4 room2)
   deleted: (at-robby robot1 room4)
   added: (at-robby robot1 room2)
   goals met: 11 of 15
27. (drop robot1 ball3 room2 rgripper1)
   deleted: (carry robot1 ball3 rgripper1)
   added: (at ball3 room2) (free robot1 rgripper1)
   goals met: 12 of 15
28. (move robot1 room2 room1)
   deleted: (at-robby robot1 room2)
   added: (at-robby robot1 room1)
   goals met: 12 of 15
29. (drop robot1 ball11 room1 lgripper1)
   deleted: (carry robot1 ball11 lgripper1)
   added: (at ball11 room1) (free robot1 lgripper1)
   goals met: 13 of 15
30. (pick robot1 ball6 room1 rgripper1)
   deleted: (at ball6 room1) (free robot1 rgripper1)
   added: (carry robot1 ball6 rgripper1)
   goals met: 13 of 15
31. (move robot1 room1 room5)
   deleted: (at-robby robot1 room1)
   added: (at-robby robot1 room5)
   goals met: 13 of 15
32. (drop robot1 ball6 room5 rgripper1)
   deleted: (carry robot1 ball6 rgripper1)
   added: (at ball6 room5) (free robot1 rgripper1)
   goals met: 14 of 15
33. (pick robot1 ball1 room5 rgripper1)
   deleted: (at ball1 room5) (free robot1 rgripper1)
   added: (carry robot1 ball1 rgripper1)
   goals met: 14 of 15
34. (move robot1 room5 room2)
   deleted: (at-robby robot1 room5)
   added: (at-robby robot1 room2)
   goals met: 14 of 15
35. (drop robot1 ball1 room2 rgripper1)
   deleted: (carry robot1 ball1 rgripper1)
   added: (at ball1 room2) (free robot1 rgripper1)
   goals met: 15 of 15
